DeviceProcessEvents
| where InitiatingProcessCommandLine matches regex @"\b(winrar|7z|rar)\b.*\ba\b.*(-p\S*\-hp\S*)"
| extend PasswordName = extract(@"-p(\S+)",1,InitiatingProcessCommandLine)
| extend ArchivedPath = extract(@"[A-Z]:\\[^]+",1,InitiatingProcessCommandLine)
| project Timestamp , DeviceName , AccountName ,FileName, InitiatingProcessFileName , InitiatingProcessCommandLine , PasswordName , ArchivedPath
|order by Timestamp desc 
